Microchip-MPLAB-Harmony/csp/apps/wdt/wdt_timeout/firmware/src/packs/ATSAML10E16A_DFP/component/opamp.h
/* -------- OPAMP_OPAMPCTRL1 : (OPAMP Offset: 0x08) (R/W 32) OPAMP1 Control -------- */
#define OPAMP_OPAMPCTRL1_RESETVALUE         _U_(0x00)                                     /**<  (OPAMP_OPAMPCTRL1) OPAMP1 Control  Reset Value */

#define OPAMP_OPAMPCTRL1_ENABLE_Pos           _U_(1)                                         /**< (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL1_ENABLE_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_ENABLE_Pos)      /**< (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL1_ANAOUT_Pos           _U_(2)                                         /**< (OPAMP_OPAMPCTRL1) Analog Output Position */
#define OPAMP_OPAMPCTRL1_ANAOUT_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_ANAOUT_Pos)      /**< (OPAMP_OPAMPCTRL1) Analog Output Mask */
#define OPAMP_OPAMPCTRL1_BIAS_Pos             _U_(3)                                         /**< (OPAMP_OPAMPCTRL1) Bias Selection Position */
#define OPAMP_OPAMPCTRL1_BIAS_Msk             (_U_(0x3) << OPAMP_OPAMPCTRL1_BIAS_Pos)        /**< (OPAMP_OPAMPCTRL1) Bias Selection Mask */
#define OPAMP_OPAMPCTRL1_BIAS(value)          (OPAMP_OPAMPCTRL1_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL1_BIAS_Pos))
#define OPAMP_OPAMPCTRL1_RES2VCC_Pos          _U_(5)                                         /**< (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL1_RES2VCC_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL1_RES2VCC_Pos)     /**< (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Pos         _U_(6)                                         /**< (OPAMP_OPAMPCTRL1) Run in Standby Position */
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos)    /**< (OPAMP_OPAMPCTRL1) Run in Standby Mask */
#define OPAMP_OPAMPCTRL1_ONDEMAND_Pos         _U_(7)                                         /**< (OPAMP_OPAMPCTRL1) On Demand Control Position */
#define OPAMP_OPAMPCTRL1_ONDEMAND_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL1_ONDEMAND_Pos)    /**< (OPAMP_OPAMPCTRL1) On Demand Control Mask */
#define OPAMP_OPAMPCTRL1_RES2OUT_Pos          _U_(8)                                         /**< (OPAMP_OPAMPCTRL1) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL1_RES2OUT_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL1_RES2OUT_Pos)     /**< (OPAMP_OPAMPCTRL1) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL1_RES1EN_Pos           _U_(9)                                         /**< (OPAMP_OPAMPCTRL1) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL1_RES1EN_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_RES1EN_Pos)      /**< (OPAMP_OPAMPCTRL1) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL1_RES1MUX_Pos          _U_(10)                                        /**< (OPAMP_OPAMPCTRL1) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL1_RES1MUX_Msk          (_U_(0x7) << OPAMP_OPAMPCTRL1_RES1MUX_Pos)     /**< (OPAMP_OPAMPCTRL1) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL1_RES1MUX(value)       (OPAMP_OPAMPCTRL1_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL1_RES1MUX_Pos))
#define   OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS_Val _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL1) Positive inout of OPAMPx  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG_Val _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL1) Negative input of OPAMPx  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_GND_Val    _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val _U_(0x4)                                       /**< (OPAMP_OPAMPCTRL1) RG_CONN  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS       (OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Positive inout of OPAMPx Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG       (OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Negative input of OPAMPx Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT       (OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_GND          (OPAMP_OPAMPCTRL1_RES1MUX_GND_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN      (OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) RG_CONN Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_Pos           _U_(13)                                        /**< (OPAMP_OPAMPCTRL1) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL1_POTMUX_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL1_POTMUX_Pos)      /**< (OPAMP_OPAMPCTRL1) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL1_POTMUX(value)        (OPAMP_OPAMPCTRL1_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL1_POTMUX_Pos))
#define   OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 0.14  */
#define   OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 0.33  */
#define   OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val   _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 1  */
#define   OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val  _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 1.67  */
#define   OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val  _U_(0x4)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 3  */
#define   OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val  _U_(0x5)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 4.33  */
#define   OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val  _U_(0x6)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 7  */
#define   OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val   _U_(0x7)                                       /**< (OPAMP_OPAMPCTRL1) Gain = 15  */
#define OPAMP_OPAMPCTRL1_POTMUX_14R_2R        (OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 0.14 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_12R_4R        (OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 0.33 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_8R_8R         (OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 1 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_6R_10R        (OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 1.67 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_4R_12R        (OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 3 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_3R_13R        (OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 4.33 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_2R_14R        (OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 7 Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_R_15R         (OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) Gain = 15 Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_Pos           _U_(16)                                        /**< (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXPOS_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL1_MUXPOS_Pos)      /**< (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXPOS(value)        (OPAMP_OPAMPCTRL1_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXPOS_Pos))
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL1) Positive I/O pin  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL1) Resistor ladder 1 taps  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_GND_Val     _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val  _U_(0x4)                                       /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1POS        (OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Positive I/O pin Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP        (OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Resistor ladder 1 taps Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC (OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_GND           (OPAMP_OPAMPCTRL1_MUXPOS_GND_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT        (OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_Pos           _U_(20)                                        /**< (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXNEG_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL1_MUXNEG_Pos)      /**< (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXNEG(value)        (OPAMP_OPAMPCTRL1_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXNEG_Pos))
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL1) Negative I/O pin  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL1) Resistor ladder 0 taps  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val  _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) Negative I/O pin Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP        (OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) Resistor ladder 0 taps Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC (OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT        (OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_Msk                  _U_(0x00FFFFFE)                                /**< (OPAMP_OPAMPCTRL1) Register Mask  */


/* -------- OPAMP_OPAMPCTRL2 : (OPAMP Offset: 0x0C) (R/W 32) OPAMP2 Control -------- */
#define OPAMP_OPAMPCTRL2_RESETVALUE         _U_(0x00)                                     /**<  (OPAMP_OPAMPCTRL2) OPAMP2 Control  Reset Value */

#define OPAMP_OPAMPCTRL2_ENABLE_Pos           _U_(1)                                         /**< (OPAMP_OPAMPCTRL2) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL2_ENABLE_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_ENABLE_Pos)      /**< (OPAMP_OPAMPCTRL2) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL2_ANAOUT_Pos           _U_(2)                                         /**< (OPAMP_OPAMPCTRL2) Analog Output Position */
#define OPAMP_OPAMPCTRL2_ANAOUT_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_ANAOUT_Pos)      /**< (OPAMP_OPAMPCTRL2) Analog Output Mask */
#define OPAMP_OPAMPCTRL2_BIAS_Pos             _U_(3)                                         /**< (OPAMP_OPAMPCTRL2) Bias Selection Position */
#define OPAMP_OPAMPCTRL2_BIAS_Msk             (_U_(0x3) << OPAMP_OPAMPCTRL2_BIAS_Pos)        /**< (OPAMP_OPAMPCTRL2) Bias Selection Mask */
#define OPAMP_OPAMPCTRL2_BIAS(value)          (OPAMP_OPAMPCTRL2_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL2_BIAS_Pos))
#define OPAMP_OPAMPCTRL2_RES2VCC_Pos          _U_(5)                                         /**< (OPAMP_OPAMPCTRL2) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL2_RES2VCC_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL2_RES2VCC_Pos)     /**< (OPAMP_OPAMPCTRL2) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL2_RUNSTDBY_Pos         _U_(6)                                         /**< (OPAMP_OPAMPCTRL2) Run in Standby Position */
#define OPAMP_OPAMPCTRL2_RUNSTDBY_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL2_RUNSTDBY_Pos)    /**< (OPAMP_OPAMPCTRL2) Run in Standby Mask */
#define OPAMP_OPAMPCTRL2_ONDEMAND_Pos         _U_(7)                                         /**< (OPAMP_OPAMPCTRL2) On Demand Control Position */
#define OPAMP_OPAMPCTRL2_ONDEMAND_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL2_ONDEMAND_Pos)    /**< (OPAMP_OPAMPCTRL2) On Demand Control Mask */
#define OPAMP_OPAMPCTRL2_RES2OUT_Pos          _U_(8)                                         /**< (OPAMP_OPAMPCTRL2) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL2_RES2OUT_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL2_RES2OUT_Pos)     /**< (OPAMP_OPAMPCTRL2) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL2_RES1EN_Pos           _U_(9)                                         /**< (OPAMP_OPAMPCTRL2) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL2_RES1EN_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_RES1EN_Pos)      /**< (OPAMP_OPAMPCTRL2) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL2_RES1MUX_Pos          _U_(10)                                        /**< (OPAMP_OPAMPCTRL2) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL2_RES1MUX_Msk          (_U_(0x7) << OPAMP_OPAMPCTRL2_RES1MUX_Pos)     /**< (OPAMP_OPAMPCTRL2) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL2_RES1MUX(value)       (OPAMP_OPAMPCTRL2_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL2_RES1MUX_Pos))
#define   OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS_Val _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL2) Positive inout of OPAMPx  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG_Val _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL2) Negative input of OPAMPx  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL2) OPAMP1 output  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_GND_Val    _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL2) Ground  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS       (OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Positive inout of OPAMPx Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG       (OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Negative input of OPAMPx Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT       (OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP1 output Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_GND          (OPAMP_OPAMPCTRL2_RES1MUX_GND_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Ground Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_Pos           _U_(13)                                        /**< (OPAMP_OPAMPCTRL2) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL2_POTMUX_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL2_POTMUX_Pos)      /**< (OPAMP_OPAMPCTRL2) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL2_POTMUX(value)        (OPAMP_OPAMPCTRL2_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL2_POTMUX_Pos))
#define   OPAMP_OPAMPCTRL2_POTMUX_14R_2R_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 0.14  */
#define   OPAMP_OPAMPCTRL2_POTMUX_12R_4R_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 0.33  */
#define   OPAMP_OPAMPCTRL2_POTMUX_8R_8R_Val   _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 1  */
#define   OPAMP_OPAMPCTRL2_POTMUX_6R_10R_Val  _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 1.67  */
#define   OPAMP_OPAMPCTRL2_POTMUX_4R_12R_Val  _U_(0x4)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 3  */
#define   OPAMP_OPAMPCTRL2_POTMUX_3R_13R_Val  _U_(0x5)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 4.33  */
#define   OPAMP_OPAMPCTRL2_POTMUX_2R_14R_Val  _U_(0x6)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 7  */
#define   OPAMP_OPAMPCTRL2_POTMUX_R_15R_Val   _U_(0x7)                                       /**< (OPAMP_OPAMPCTRL2) Gain = 15  */
#define OPAMP_OPAMPCTRL2_POTMUX_14R_2R        (OPAMP_OPAMPCTRL2_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 0.14 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_12R_4R        (OPAMP_OPAMPCTRL2_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 0.33 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_8R_8R         (OPAMP_OPAMPCTRL2_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 1 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_6R_10R        (OPAMP_OPAMPCTRL2_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 1.67 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_4R_12R        (OPAMP_OPAMPCTRL2_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 3 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_3R_13R        (OPAMP_OPAMPCTRL2_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 4.33 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_2R_14R        (OPAMP_OPAMPCTRL2_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 7 Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_R_15R         (OPAMP_OPAMPCTRL2_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) Gain = 15 Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_Pos           _U_(16)                                        /**< (OPAMP_OPAMPCTRL2) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL2_MUXPOS_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL2_MUXPOS_Pos)      /**< (OPAMP_OPAMPCTRL2) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL2_MUXPOS(value)        (OPAMP_OPAMPCTRL2_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXPOS_Pos))
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA2POS_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL2) Positive I/O pin  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_REFERENCE_DAC_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL2) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_GND_Val     _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL2) Ground  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT_Val  _U_(0x4)                                       /**< (OPAMP_OPAMPCTRL2) OPAMP1 output  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA0POS_Val  _U_(0x5)                                       /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA0  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA1POS_Val  _U_(0x6)                                       /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA1  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP_Val  _U_(0x7)                                       /**< (OPAMP_OPAMPCTRL2) OPAMP0 Resistor Ladder Taps  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_RES3TAP_Val _U_(0x7)                                       /**< (OPAMP_OPAMPCTRL2) Resistor ladder 3 taps  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA2POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA2POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP        (OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_REFERENCE_DAC (OPAMP_OPAMPCTRL2_MUXPOS_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_GND           (OPAMP_OPAMPCTRL2_MUXPOS_GND_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Ground Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT        (OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP1 output Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA0POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA0POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA0 Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA1POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA1POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA1 Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP        (OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP0 Resistor Ladder Taps Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_RES3TAP       (OPAMP_OPAMPCTRL2_MUXPOS_RES3TAP_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 3 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_Pos           _U_(20)                                        /**< (OPAMP_OPAMPCTRL2) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL2_MUXNEG_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL2_MUXNEG_Pos)      /**< (OPAMP_OPAMPCTRL2) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL2_MUXNEG(value)        (OPAMP_OPAMPCTRL2_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXNEG_Pos))
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG_Val  _U_(0x0)                                       /**< (OPAMP_OPAMPCTRL2) Negative I/O pin  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA0TAP_Val  _U_(0x1)                                       /**< (OPAMP_OPAMPCTRL2) Resistor ladder 0 taps  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_REFERENCE_DAC_Val _U_(0x2)                                       /**< (OPAMP_OPAMPCTRL2) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA0OUT_Val  _U_(0x3)                                       /**< (OPAMP_OPAMPCTRL2) OPAMP0 output  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Negative I/O pin Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA0TAP        (OPAMP_OPAMPCTRL2_MUXNEG_OA0TAP_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 0 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_REFERENCE_DAC (OPAMP_OPAMPCTRL2_MUXNEG_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA0OUT        (OPAMP_OPAMPCTRL2_MUXNEG_OA0OUT_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL2_Msk                  _U_(0x00FFFFFE)                                /**< (OPAMP_OPAMPCTRL2) Register Mask  */


/* -------- OPAMP_RESCTRL : (OPAMP Offset: 0x10) (R/W 8) Resister Control -------- */
#define OPAMP_RESCTRL_RESETVALUE            _U_(0x00)                                     /**<  (OPAMP_RESCTRL) Resister Control  Reset Value */

