Microchip-MPLAB-Harmony/csp/apps/wdt/wdt_timeout/firmware/src/packs/ATSAML10E16A_DFP/component/opamp.h
#define OPAMP_RESCTRL_RES2OUT_Pos             _U_(0)                                         /**< (OPAMP_RESCTRL) Resistor ladder To Output Position */
#define OPAMP_RESCTRL_RES2OUT_Msk             (_U_(0x1) << OPAMP_RESCTRL_RES2OUT_Pos)        /**< (OPAMP_RESCTRL) Resistor ladder To Output Mask */
#define OPAMP_RESCTRL_RES1EN_Pos              _U_(1)                                         /**< (OPAMP_RESCTRL) Resistor 1 Enable Position */
#define OPAMP_RESCTRL_RES1EN_Msk              (_U_(0x1) << OPAMP_RESCTRL_RES1EN_Pos)         /**< (OPAMP_RESCTRL) Resistor 1 Enable Mask */
#define OPAMP_RESCTRL_RES1MUX_Pos             _U_(2)                                         /**< (OPAMP_RESCTRL) Resistor 1 Mux Position */
#define OPAMP_RESCTRL_RES1MUX_Msk             (_U_(0x1) << OPAMP_RESCTRL_RES1MUX_Pos)        /**< (OPAMP_RESCTRL) Resistor 1 Mux Mask */
#define   OPAMP_RESCTRL_RES1MUX_DAC_Val       _U_(0x0)                                       /**< (OPAMP_RESCTRL) DAC output  */
#define   OPAMP_RESCTRL_RES1MUX_REFBUF_Val    _U_(0x1)                                       /**< (OPAMP_RESCTRL) REFERENCE output  */
#define OPAMP_RESCTRL_RES1MUX_DAC             (OPAMP_RESCTRL_RES1MUX_DAC_Val << OPAMP_RESCTRL_RES1MUX_Pos) /**< (OPAMP_RESCTRL) DAC output Position  */
#define OPAMP_RESCTRL_RES1MUX_REFBUF          (OPAMP_RESCTRL_RES1MUX_REFBUF_Val << OPAMP_RESCTRL_RES1MUX_Pos) /**< (OPAMP_RESCTRL) REFERENCE output Position  */
#define OPAMP_RESCTRL_POTMUX_Pos              _U_(3)                                         /**< (OPAMP_RESCTRL) Potentiometer Selection Position */
#define OPAMP_RESCTRL_POTMUX_Msk              (_U_(0x7) << OPAMP_RESCTRL_POTMUX_Pos)         /**< (OPAMP_RESCTRL) Potentiometer Selection Mask */
#define OPAMP_RESCTRL_POTMUX(value)           (OPAMP_RESCTRL_POTMUX_Msk & ((value) << OPAMP_RESCTRL_POTMUX_Pos))
#define   OPAMP_RESCTRL_POTMUX_14R_2R_Val     _U_(0x0)                                       /**< (OPAMP_RESCTRL) Gain = 0.14  */
#define   OPAMP_RESCTRL_POTMUX_12R_4R_Val     _U_(0x1)                                       /**< (OPAMP_RESCTRL) Gain = 0.33  */
#define   OPAMP_RESCTRL_POTMUX_8R_8R_Val      _U_(0x2)                                       /**< (OPAMP_RESCTRL) Gain = 1  */
#define   OPAMP_RESCTRL_POTMUX_6R_10R_Val     _U_(0x3)                                       /**< (OPAMP_RESCTRL) Gain = 1.67  */
#define   OPAMP_RESCTRL_POTMUX_4R_12R_Val     _U_(0x4)                                       /**< (OPAMP_RESCTRL) Gain = 3  */
#define   OPAMP_RESCTRL_POTMUX_3R_13R_Val     _U_(0x5)                                       /**< (OPAMP_RESCTRL) Gain = 4.33  */
#define   OPAMP_RESCTRL_POTMUX_2R_14R_Val     _U_(0x6)                                       /**< (OPAMP_RESCTRL) Gain = 7  */
#define   OPAMP_RESCTRL_POTMUX_R_15R_Val      _U_(0x7)                                       /**< (OPAMP_RESCTRL) Gain = 15  */
#define OPAMP_RESCTRL_POTMUX_14R_2R           (OPAMP_RESCTRL_POTMUX_14R_2R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 0.14 Position  */
#define OPAMP_RESCTRL_POTMUX_12R_4R           (OPAMP_RESCTRL_POTMUX_12R_4R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 0.33 Position  */
#define OPAMP_RESCTRL_POTMUX_8R_8R            (OPAMP_RESCTRL_POTMUX_8R_8R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 1 Position  */
#define OPAMP_RESCTRL_POTMUX_6R_10R           (OPAMP_RESCTRL_POTMUX_6R_10R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 1.67 Position  */
#define OPAMP_RESCTRL_POTMUX_4R_12R           (OPAMP_RESCTRL_POTMUX_4R_12R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 3 Position  */
#define OPAMP_RESCTRL_POTMUX_3R_13R           (OPAMP_RESCTRL_POTMUX_3R_13R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 4.33 Position  */
#define OPAMP_RESCTRL_POTMUX_2R_14R           (OPAMP_RESCTRL_POTMUX_2R_14R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 7 Position  */
#define OPAMP_RESCTRL_POTMUX_R_15R            (OPAMP_RESCTRL_POTMUX_R_15R_Val << OPAMP_RESCTRL_POTMUX_Pos) /**< (OPAMP_RESCTRL) Gain = 15 Position  */
#define OPAMP_RESCTRL_REFBUFLEVEL_Pos         _U_(6)                                         /**< (OPAMP_RESCTRL) Reference output voltage level select Position */
#define OPAMP_RESCTRL_REFBUFLEVEL_Msk         (_U_(0x3) << OPAMP_RESCTRL_REFBUFLEVEL_Pos)    /**< (OPAMP_RESCTRL) Reference output voltage level select Mask */
#define OPAMP_RESCTRL_REFBUFLEVEL(value)      (OPAMP_RESCTRL_REFBUFLEVEL_Msk & ((value) << OPAMP_RESCTRL_REFBUFLEVEL_Pos))
#define   OPAMP_RESCTRL_REFBUFLEVEL_1_1v_Val  _U_(0x0)                                       /**< (OPAMP_RESCTRL) 1.1v  */
#define   OPAMP_RESCTRL_REFBUFLEVEL_1_25v_Val _U_(0x1)                                       /**< (OPAMP_RESCTRL) 1.25v  */
#define   OPAMP_RESCTRL_REFBUFLEVEL_1_6v_Val  _U_(0x2)                                       /**< (OPAMP_RESCTRL) 1.6v  */
#define OPAMP_RESCTRL_REFBUFLEVEL_1_1v        (OPAMP_RESCTRL_REFBUFLEVEL_1_1v_Val << OPAMP_RESCTRL_REFBUFLEVEL_Pos) /**< (OPAMP_RESCTRL) 1.1v Position  */
#define OPAMP_RESCTRL_REFBUFLEVEL_1_25v       (OPAMP_RESCTRL_REFBUFLEVEL_1_25v_Val << OPAMP_RESCTRL_REFBUFLEVEL_Pos) /**< (OPAMP_RESCTRL) 1.25v Position  */
#define OPAMP_RESCTRL_REFBUFLEVEL_1_6v        (OPAMP_RESCTRL_REFBUFLEVEL_1_6v_Val << OPAMP_RESCTRL_REFBUFLEVEL_Pos) /**< (OPAMP_RESCTRL) 1.6v Position  */
#define OPAMP_RESCTRL_Msk                     _U_(0xFF)                                      /**< (OPAMP_RESCTRL) Register Mask  */


/** \brief OPAMP register offsets definitions */
#define OPAMP_CTRLA_REG_OFST           (0x00)         /**< (OPAMP_CTRLA) Control A Offset */
#define OPAMP_STATUS_REG_OFST          (0x02)         /**< (OPAMP_STATUS) Status Offset */
#define OPAMP_OPAMPCTRL0_REG_OFST      (0x04)         /**< (OPAMP_OPAMPCTRL0) OPAMP0 Control Offset */
#define OPAMP_OPAMPCTRL1_REG_OFST      (0x08)         /**< (OPAMP_OPAMPCTRL1) OPAMP1 Control Offset */
#define OPAMP_OPAMPCTRL2_REG_OFST      (0x0C)         /**< (OPAMP_OPAMPCTRL2) OPAMP2 Control Offset */
#define OPAMP_RESCTRL_REG_OFST         (0x10)         /**< (OPAMP_RESCTRL) Resister Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief OPAMP register API structure */
typedef struct
{  /* Operational Amplifier */
  __IO  uint8_t                        OPAMP_CTRLA;     /**< Offset: 0x00 (R/W  8) Control A */
  __I   uint8_t                        Reserved1[0x01];
  __I   uint8_t                        OPAMP_STATUS;    /**< Offset: 0x02 (R/   8) Status */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint32_t                       OPAMPCTRL0;      /**< Offset: 0x04 (R/W  32) OPAMP0 Control */
  __IO  uint32_t                       OPAMPCTRL1;      /**< Offset: 0x08 (R/W  32) OPAMP1 Control */
  __IO  uint32_t                       OPAMPCTRL2;      /**< Offset: 0x0C (R/W  32) OPAMP2 Control */
  __IO  uint8_t                        OPAMP_RESCTRL;   /**< Offset: 0x10 (R/W  8) Resister Control */
} opamp_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML10_OPAMP_COMPONENT_H_ */
